![title](imagens/M05-Pandas.jpg)

# Pandas - Noções básicas do pacote Pandas - Parte 6

## Funções e Métodos

### 6.1 Introdução às Funções e Métodos

**Funções:**

Realizam operações específicas em colunas ou linhas de um DataFrame. Podem ser aplicadas a uma série ou a todo o DataFrame.

**Métodos:**
São funções específicas do Pandas que operam em DataFrames. São chamados usando a sintaxe df.metodo().

### 6.2 Exemplo Inicial: Criando um DataFrame Simples

In [1]:
import pandas as pd

data = {'Nome': ['Alice', 'Bob', 'Carol'],
        'Idade': [25, 30, 22],
        'Salário': [5000, 6000, 7000]}

df = pd.DataFrame(data)

df.head()

    Nome  Idade  Salário
0  Alice     25     5000
1    Bob     30     6000
2  Carol     22     7000

### 6.3 Funções e Métodos

**a) unique() e nunique()**

- unique(): Retorna os valores únicos em uma coluna.

- nunique(): Retorna o número de valores únicos em uma coluna.

In [2]:
# Retorna os valores únicos na coluna especificada
print(df['Nome'].unique())

['Alice' 'Bob' 'Carol']

In [3]:
# Retorna o número de valores únicos na coluna especificada
print(df['Idade'].nunique())

3

**b) value_counts()**

- Retorna a contagem de valores únicos em uma coluna.

In [4]:
# Retorna os valores únicos em uma determinada coluna
print(df['Nome'].value_counts())

Nome
Alice    1
Bob      1
Carol    1
Name: count, dtype: int64

**c) apply()**

- Aplica uma função a cada elemento de uma coluna.

In [6]:
# definindo uma função
def dobrar_salario(salario):
    return salario * 2

In [7]:
# aplicando a função
df['Salário_Dobrado'] = df['Salário'].apply(dobrar_salario)
df

    Nome  Idade  Salário  Salário_Dobrado
0  Alice     25     5000            10000
1    Bob     30     6000            12000
2  Carol     22     7000            14000

**d) Funções de Agregação**

sum(), mean(), max(), min(), idxmax(), idxmin()

In [8]:
print(df['Salário'].sum())
print(df['Idade'].mean())
print(df['Salário'].max())
print(df['Idade'].min())
print(df['Salário'].idxmax())

18000
25.666666666666668
7000
22
2

**e) Operações Aritméticas**

add(), mul(), div()

In [9]:
df['Salário_Aumentado'] = df['Salário'].add(1000)
df

    Nome  Idade  Salário  Salário_Dobrado  Salário_Aumentado
0  Alice     25     5000            10000               6000
1    Bob     30     6000            12000               7000
2  Carol     22     7000            14000               8000

**f) map()**

Mapeia valores de uma coluna para outros valores.

In [10]:
genero_map = {'Alice': 'F', 'Bob': 'M', 'Carol': 'F'}
df['Gênero'] = df['Nome'].map(genero_map)

In [11]:
df

    Nome  Idade  Salário  Salário_Dobrado  Salário_Aumentado Gênero
0  Alice     25     5000            10000               6000      F
1    Bob     30     6000            12000               7000      M
2  Carol     22     7000            14000               8000      F

**g) where()**

Substitui valores com base em uma condição.

In [12]:
df['Salário_Alto'] = df['Salário'].where(df['Salário'] > 6000, other=0)

In [13]:
df

,Nome,Idade,Salário,Salário_Dobrado,Salário_Aumentado,Gênero,Salário_Alto
0,Alice,25,5000,10000,6000,F,0
1,Bob,30,6000,12000,7000,M,0
2,Carol,22,7000,14000,8000,F,7000

**h) copy()**

Cria uma cópia independente do DataFrame.

In [14]:
df_copia = df.copy()

In [15]:
df

,Nome,Idade,Salário,Salário_Dobrado,Salário_Aumentado,Gênero,Salário_Alto
0,Alice,25,5000,10000,6000,F,0
1,Bob,30,6000,12000,7000,M,0
2,Carol,22,7000,14000,8000,F,7000

In [16]:
df_copia

,Nome,Idade,Salário,Salário_Dobrado,Salário_Aumentado,Gênero,Salário_Alto
0,Alice,25,5000,10000,6000,F,0
1,Bob,30,6000,12000,7000,M,0
2,Carol,22,7000,14000,8000,F,7000

O comando `df.copy()` é utilizado para criar uma cópia profunda do DataFrame `df`. 

Essa cópia é independente do DataFrame original, o que significa que quaisquer alterações feitas na cópia não afetarão o DataFrame original e vice-versa. 

É útil utilizar `df.copy()` quando se deseja modificar um DataFrame sem modificar o original, preservando assim os dados originais.

# FIM